{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_12", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_24_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_25", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_12", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "dtype": "float32", "rate": 0.6, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_24/kernel", "shape": [5, 5, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3250124454498291, "scale": 0.0021812915802001953, "original_dtype": "float32"}}, {"name": "conv2d_24/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0984174432561678, "scale": 0.0006037879954366123, "original_dtype": "float32"}}, {"name": "conv2d_25/kernel", "shape": [5, 5, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3350255510386299, "scale": 0.0028391995850731346, "original_dtype": "float32"}}, {"name": "conv2d_25/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04893090069001796, "scale": 0.0008021459129511141, "original_dtype": "float32"}}, {"name": "dense_24/kernel", "shape": [1024, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.29968554622986737, "scale": 0.0031881441088283764, "original_dtype": "float32"}}, {"name": "dense_24/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.041632072130839026, "scale": 0.00034984934563730275, "original_dtype": "float32"}}, {"name": "dense_25/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4064566438104592, "scale": 0.0031027224718355663, "original_dtype": "float32"}}, {"name": "dense_25/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21594078838825226, "scale": 1.0, "original_dtype": "float32"}}]}]}